#21.	 
# Примеры
# список: ["qwe", "asd", "zxc", "qwe", "ertqwe"], ищем: "qwe", ответ: 3
# список: ["йцу", "фыв", "ячс", "цук", "йцукен", "йцу"], ищем: "йцу", ответ: 5
# список: ["йцу", "фыв", "ячс", "цук", "йцукен"], ищем: "йцу", ответ: -1
# список: ["123", "234", 123, "567"], ищем: "123", ответ: -1
# список: [], ищем: "123", ответ: -1
my_spisok= ['frd','tafg','543','123','frd','123','rev','frd'] 
list1=[i for i,x in enumerate(my_spisok) if x=='frd'] 
if len(list1)>1: 
     print(list1[1])
else: print('-1')

